wrk_get_users_healthcheck.txt
Running 10s test @ http://localhost:5500
  12 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.13ms    1.63ms  41.12ms   94.80%
    Req/Sec    19.23k     6.94k   31.80k    56.67%
  Latency Distribution
     50%    3.90ms
     75%    4.44ms
     90%    5.03ms
     99%   11.71ms
  2296130 requests in 10.02s, 306.57MB read
  Socket errors: connect 985, read 0, write 0, timeout 0
Requests/sec: 229218.95
Transfer/sec:     30.60MB